trunk/zhikebaocrm/app/controllers/tasks_controller.rb

SELECT * FROM `tasks` WHERE ((((completed_at IS NULL) AND ((due_at IS NULL AND bucket = 'due_later') OR due_at >= '2010-02-01 23:59:59')) AND ((user_id = 1 AND assigned_to IS NULL) OR assigned_to = 1)) AND (tasks.deleted_at IS NULL OR tasks.deleted_at > '2010-01-21 06:59:55')) ORDER BY id DESC
---
  def index
    @view = params[:view] || "pending"
    @tasks = Task.find_all_grouped(@current_user, @view)

SELECT * FROM `users` WHERE ((id != 1 ) AND (users.deleted_at IS NULL OR users.deleted_at > '2010-01-21 07:00:06')) ORDER BY id DESC
---
  def new
    @view = params[:view] || "pending"
    @task = Task.new
    @users = User.except(@current_user).all

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 145) AND ((user_id = 1 OR assigned_to = 1) AND (tasks.deleted_at IS NULL OR tasks.deleted_at > '2010-01-21 08:28:06'))
SELECT * FROM `users` WHERE ((id != 1 ) AND (users.deleted_at IS NULL OR users.deleted_at > '2010-01-21 08:28:06')) ORDER BY id DESC
---
  def edit
    @view = params[:view] || "pending"
    @task = Task.tracked_by(@current_user).find(params[:id])
    @users = User.except(@current_user).all

INSERT INTO `tasks` (`name`, `completed_at`, `assigned_to`, `category`, `updated_at`, `bucket`, `deleted_at`, `completed_by`, `priority`, `user_id`, `due_at`, `asset_type`, `asset_id`, `created_at`) VALUES('测试各个功能', NULL, NULL, 'call', '2010-01-21 07:43:06', 'due_asap', NULL, NULL, NULL, 1, NULL, '', NULL, '2010-01-21 07:43:06')
---
  def create
    @task = Task.new(params[:task]) # NOTE: we don't display validation messages for tasks.
    @view = params[:view] || "pending"

    respond_to do |format|
      if @task.save

SELECT * FROM `tasks` WHERE (`tasks`.`id` = 253) AND ((user_id = 1 OR assigned_to = 1) AND (tasks.deleted_at IS NULL OR tasks.deleted_at > '2010-01-21 07:43:22'))
UPDATE `tasks` SET `due_at` = '2010-01-21 00:00:00', `completed_at` = '2010-01-21 07:43:22', `updated_at` = '2010-01-21 07:43:22', `completed_by` = 1 WHERE `id` = 253
UPDATE `users` SET `perishable_token` = 'h7PU3ueBNnV442pF-Hc5', `updated_at` = '2010-01-21 07:43:22', `last_request_at` = '2010-01-21 07:43:22' WHERE `id` = 1
---
  def complete
    @task = Task.tracked_by(@current_user).find(params[:id])
    @task.update_attributes(:completed_at => Time.now, :completed_by => @current_user.id) if @task