trunk/zhikebaocrm/app/controllers/users_controller.rb

  def show
    @user = params[:id] ? User.find(params[:id]) : @current_user
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') AND (users.deleted_at IS NULL OR users.deleted_at > '2010-01-21 07:45:02') ORDER BY id DESC LIMIT 1

  def upload_avatar
    if params[:gravatar]
      @user.avatar = nil
      @user.save
      render
    else
      if params[:avatar]
        @user.avatar = Avatar.new(params[:avatar].merge(:entity => @user))
        unless @user.save && @user.avatar.errors.blank?
---
INSERT INTO `avatars` (`entity_type`, `image_file_size`, `entity_id`, `updated_at`, `image_content_type`, `user_id`, `image_file_name`, `created_at`) VALUES('User', 165805, 1, '2010-01-21 07:46:19', 'image/jpeg', NULL, '_.jpg', '2010-01-21 07:46:19')
UPDATE `users` SET `perishable_token` = 'b357XC4rNAEO7FWrbKI6', `updated_at` = '2010-01-21 07:46:11', `last_request_at` = '2010-01-21 07:46:11' WHERE `id` = 1
SELECT * FROM `avatars` WHERE (`avatars`.entity_id = 1 AND `avatars`.entity_type = 'User') LIMIT 1